pmo-dataset/variations/graphviz_basic/13.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "start" -> "File complaint";
  "ExclusiveGateway_3" -> "Resolve complaint";
  "Resolve complaint" -> "ExclusiveGateway_4";
  "ExclusiveGateway_4" -> "Provide feedback";
  "ExclusiveGateway_1" -> "end";
  "ExclusiveGateway_4" -> "ExclusiveGateway_1";
  "ExclusiveGateway_2" -> "Approve and notify customer";
  "Reject and notify customer" -> "ExclusiveGateway_3";
  "Log complaint" -> "Assign complaint to relevant department";
  "Review complaint details" -> "ExclusiveGateway_2";
  "Provide feedback" -> "ExclusiveGateway_1";
  "File complaint" -> "Log complaint";
  "ExclusiveGateway_2" -> "Reject and notify customer";
  "Process reimbursement" -> "ExclusiveGateway_3";
  "Approve and notify customer" -> "Process reimbursement";
  "Assign complaint to relevant department" -> "Review complaint details";

  "start" [shape=circle, label="start"];
  "end" [shape=circle, label="end"];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ExclusiveGateway_3" [shape=diamond, label="X"];
  "ExclusiveGateway_4" [shape=diamond, label="X"];
}
